/*         Військовий аеродром TAirfield
 постачає літаки, керований таймером і генератором випадкових чисел.

 Посилання на список літаків потрібне, щоб було куди додавати створені літаки.
 Контекст потрібен літакові для відображення себе.
 m_interval зберігає випадкову величину: скільки ще часу залишилося
  до наступного створення літака
*/

#include "Lists.h"

class TAirfield
{
	TAircraftList& m_aircraft_list;
	HDC m_dc;
	int m_interval;
public:
	TAirfield(TAircraftList& list, HDC dc);
	// створення нового літака
	TAircraft* SendAircraft();
	// повідомлення від таймера, що пройшло t одиниць часу: можливо,
	//  пора створити новий літак
	void Spent(int t);
};